In [1]:
import pandas as pd

In [5]:
import pandas as pd
series= pd.Series(["bmw","toyota","honda"])
series

0       bmw
1    toyota
2     honda
dtype: object

In [7]:
#DataFrame =2-dimentional
colors= pd.Series(["red","green","pink"])
car_data = pd.DataFrame ({"Car make": series, "Colour": colors})
car_data

  Car make Colour
0      bmw    red
1   toyota  green
2    honda   pink

In [10]:
import pandas as pd

# Assuming "Sample-Spreadsheet-100-rows.csv" is in the same directory as your script
csv_file_path = "Sample-Spreadsheet-100-rows.csv"

# Read the CSV file into a Pandas DataFrame with a specified encoding
raw_data = pd.read_csv(csv_file_path, encoding='latin1')

# Display the DataFrame
print(raw_data)

      1   Eldon Base for stackable storage shelf, platinum Muhammed MacIntyre  \
0     2  1.7 Cubic Foot Compact "Cube" Office Refrigera...       Barry French
1     3   Cardinal Slant-D® Ring Binder, Heavy Gauge Vinyl       Barry French
2     4                                               R380      Clay Rozendal
3     5                           Holmes HEPA Air Purifier     Carlos Soltero
4     6  G.E. Longer-Life Indoor Recessed Floodlight Bulbs     Carlos Soltero
..  ...                                                ...                ...
94   96              Linden® 12" Wall Clock With Oak Frame      Doug Bickford
95   97                                         Newell 326      Doug Bickford
96   98                       Prismacolor Color Pencil Set       Jamie Kunitz
97   99                         Xerox Blank Computer Paper    Anthony Johnson
98  100                                    600 Series Flip       Ralph Knight

        3  -213.25   38.94     35                Nunavut  \
0     293   457.81  208.16  68.02                Nunavut
1     293    46.71    8.69   2.99                Nunavut
2     483  1198.97  195.99   3.99                Nunavut
3     515    30.94   21.78   5.94                Nunavut
4     515     4.43    6.64   4.95                Nunavut
..    ...      ...     ...    ...                    ...
94  10535   -44.14   33.98  19.99  Northwest Territories
95  10535    -0.79    1.76   0.70  Northwest Territories
96  10789    76.42   19.84   4.10  Northwest Territories
97  10791    93.36   19.98   5.77  Northwest Territories
98  10945     4.22   95.99   8.99  Northwest Territories

            Storage & Organization   0.8
0                       Appliances  0.58
1   Binders and Binder Accessories  0.39
2     Telephones and Communication  0.58
3                       Appliances  0.50
4               Office Furnishings  0.37
..                             ...   ...
94              Office Furnishings  0.55
95             Pens & Art Supplies  0.56
96             Pens & Art Supplies  0.44
97                           Paper  0.38
98    Telephones and Communication  0.57

[99 rows x 10 columns]

In [11]:
import pandas as pd

# Assuming "Sample-Spreadsheet-100-rows.csv" is in the same directory as your script
csv_file_path = "car-sales.csv"

# Read the CSV file into a Pandas DataFrame with a specified encoding
raw_data = pd.read_csv(csv_file_path, encoding='latin1')

# Display the DataFrame
print(raw_data)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [14]:
import pandas as pd
car_sales= pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [15]:
#exporting a dataframe
car_sales.to_csv("exported-car-sales.csv")

In [16]:
exported_carsales=pd.read_csv("exported-car-sales.csv")
exported_carsales

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

In [17]:
heart_disease = pd.read_csv("https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/master/data/heart-disease.csv")
heart_disease

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

# descibe data -> using attributes and function

In [19]:
#attribute
car_sales.dtypes   #gonna tell us type of our coloumn
#function
#car_sales.to_csv()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [23]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [27]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [31]:
car_sales.describe()  #tell us numeric coloums (with diff function)

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [32]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [36]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [37]:
car_prices=pd.Series([3000,1500,11250])
car_prices.mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of 0     3000
1     1500
2    11250
dtype: int64>

In [38]:
car_prices=pd.Series([3000,1500,11250])
car_prices.mean()

5250.0

In [39]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [40]:
car_sales["Doors"].sum()

40

In [41]:
len(car_sales)

10

## viewing and selecting data

In [42]:
 car_sales.head()  #tell us 5 rows

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [43]:
car_sales.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [45]:
car_sales.tail(3)

     Make Colour  Odometer (KM)  Doors      Price
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [49]:
# .loc & .iloc
animals=pd.Series(["cat","dog","bird","panda","snake"],index=[0,3,5,6,-1
                                                             ])
animals

 0      cat
 3      dog
 5     bird
 6    panda
-1    snake
dtype: object

In [50]:
animals.loc[3]   ##loc->location->indexnumber

'dog'

In [51]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [53]:
#iloc->position
animals.iloc[3]

'panda'

In [54]:
animals

 0      cat
 3      dog
 5     bird
 6    panda
-1    snake
dtype: object

In [56]:
car_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [57]:
animals

 0      cat
 3      dog
 5     bird
 6    panda
-1    snake
dtype: object

In [58]:
animals.iloc[:3]  // everyting btw position 0 to 2

0     cat
3     dog
5    bird
dtype: object

In [59]:
animals.loc[:3]     //everyting btw index 0 to 2

0    cat
3    dog
dtype: object

In [60]:
car_sales.loc[:3]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [61]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [62]:
car_sales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [63]:
 car_sales.Make #same as car_sales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [64]:
car_sales[car_sales["Make"]=="Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [65]:
car_sales[car_sales["Odometer (KM)"]>10000]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00